app/Controllers/BlogController.php

SELECT *
FROM `posts`
---
    public function index()
    {
        $model = new BlogModel();
        $data = [
            'title' => 'Blog',
            'posts' => $model->findAll()