app/Controllers/ProjectController.php

    public function index()
    {
        $model = new ProjectModel();
        $data = [
            'title' => 'Projects',
            'projects' => $model->findAll()
---
SELECT *
FROM `projects`