app/Models/BlogModel.php

    public function getBlogs()
    {
        return $this->findAll();
---
SELECT *
FROM `blogs`